WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
    // From Ref Man 15.8.1
    // At the end of the last DMA transfer (number of transfers configured in the
    // DMA controller’s DMA_SxNTR register):
    // • No new DMA request is issued to the DMA controller if the DDS bit is
    // cleared to 0 in the ADC_CR2 register (this avoids generating an overrun
    // error). However the DMA bit is not cleared by hardware. It must be written
    // to 0, then to 1 to start a new transfer.
    // • Requests can continue to be generated if the DDS bit is set to 1. This
    // allows configuring the DMA in double-buffer circular mode.
    regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
    regval &= ~ADC_CR2_DMA;
    putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

    regval |= ADC_CR2_DMA;
    putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

    // Wakeup caller's thread
    sem_post(&_gpioDoneSem);
  }
}

//==========================================================================
// ADC conversion ISR
static int meadow_adc_conversion_isr(int irq, FAR void *context,
            FAR void *arg)
{
  // The interrupt conversion can be programmed to be called for the following
  // Discription                          Event Flag    Enable control bit
  // -----------                          ----------    ------------------
  // End of conversion of a regular group     EOC             EOCIE
  // End of conversion of an injected group   JEOC            JEOCIE
  // Analog watchdog status bit is set        AWD             AWDIE
  // Overrun                                  OVR             OVRIE
  uint32_t pendingInterrupts;
  uint32_t baseADCAddr = (uint32_t)arg;

  pendingInterrupts = getreg32(baseADCAddr + STM32_ADC_SR_OFFSET);

#if defined CONFIG_ADC_TESTS
  if(pendingInterrupts == 0)
  {
    syslog(1, "-- ADC ISR-NO Interrupts --\n");
    return OK;
  }

  if ((pendingInterrupts & ADC_SR_AWD) != 0)
  {
    syslog(1, "-- ADC ISR-WatchDog --\n");
  }

  if ((pendingInterrupts & ADC_SR_OVR) != 0)
  {
    syslog(1, "-- ADC ISR-Over Run --\n");

  // Note: Meadow_adc.c is ignoring data Overruns
  //
  // From Ref Man 15.8.1 & 15.8.2
  // To recover the ADC from OVR when the DMA is used, follow the steps below:
  // 1. Reinitialize the DMA (adjust destination address and NDTR counter).
  //    This is DMA
  // 2. Clear the ADC OVR bit in ADC_SR register (below)
  //    This is ADC
  // 3. Trigger the ADC to start the conversion (below)
  //    This is ADC
  //
  // Note: #1 above - there doesn't appear to be in NuttX stm32f7/stm32_dma.c
  // code a function to "Reinitialize the DMA".
  // See nuttx/arch/arm/src/stm32f7/stm32_dma.c @657-673 for code that would
  // do the above requirement (I think).
  }

  // End of conversion
  // With DMA this doesn't happen
  if ((pendingInterrupts & ADC_SR_EOC) != 0)
  {
    syslog(1, "-- ADC ISR-End of Conversion --\n");
  }
#endif

  // End of injection conversion?
  if ((pendingInterrupts & ADC_SR_JEOC) != 0)
  {
    // Wakeup caller's thread, data is ready
    sem_post(&_injectionDoneSem);
  }

  // Clear any interrupts
  pendingInterrupts &= ~ADC_ALL_POSSIBLE_ADC_INTERRUPTS;
  putreg32(pendingInterrupts, baseADCAddr + STM32_ADC_SR_OFFSET);

  return OK;
}

//==========================================================================
static void meadow_adc_buffer_takesem(sem_t *semaphore)
{
  int ret;
  do
  {
    ret = sem_wait(semaphore);
  }
  while (ret == -EINTR);
}

//==========================================================================
#if defined CONFIG_ADC_TESTS
// Only for TESTING
static void adc_test_display_basic_adc_regs(uint32_t baseADCAddr)
{
  syslog(1, "SR:  0x%08x CR1:  0x%08x CR2:  0x%08x\n",
        getreg32(baseADCAddr + STM32_ADC_SR_OFFSET),
        getreg32(baseADCAddr + STM32_ADC_CR1_OFFSET),
        getreg32(baseADCAddr + STM32_ADC_CR2_OFFSET));

  syslog(1, "SQR1: 0x%08x SQR2: 0x%08x SQR3: 0x%08x\n",
        getreg32(baseADCAddr + STM32_ADC_SQR1_OFFSET),
        getreg32(baseADCAddr + STM32_ADC_SQR2_OFFSET),
        getreg32(baseADCAddr + STM32_ADC_SQR3_OFFSET));

  syslog(1, "CCR:  0x%08x\n", getreg32(STM32_ADC_CCR));
}

static void adc_test_display_basic_dma_regs(void)
{
  syslog(1, "S0CR:  0x%08x  S0NDTR: 0x%08x\n",
        getreg32(STM32_DMA2_S0CR),
        getreg32(STM32_DMA2_S0NDTR));

  syslog(1, "S0PAR: 0x%08x  S0M0AR: 0x%08x S0M1AR: 0x%08x\n",
        getreg32(STM32_DMA2_S0PAR),
        getreg32(STM32_DMA2_S0M0AR),
        getreg32(STM32_DMA2_S0M1AR));
}
#endif

//==========================================================================
// Find ADC input channel (0-16) from the provided GPIO input port/pin
static int meadow_adc_chan_from_pinid(uint32_t pinId, uint32_t *adcInputChan)
{
  int mapOff;

  // Look for match
  for(mapOff = 0; mapOff < MEADOW_ADC_GPIO_CHAN_MAP_LENGTH; mapOff++)
  {
    if(pinId == _gpioAdcChanMap[mapOff])
    {
      *adcInputChan = mapOff;
      return OK;
    }
  }

  // Return error since no GPIO matched any valid analog input GPIOs
  return -EBADSLT;    // 55 - Invalid Slot
}

//======================================================================
// Helps fill the sequence registers
static int meadow_adc_fill_seq_chan(uint32_t *regval, uint32_t seqRegGpios,
          uint32_t initRegShift, uint8_t *userGpioList)
{
  int ret;
  uint32_t regCnt;
  uint32_t adcInputChan;

  // Cycle through all the slots in this register
  for(regCnt = 0; regCnt < seqRegGpios; regCnt++)
  {
    // For entry Pin/Port what 'ADC input' channel
    ret = meadow_adc_chan_from_pinid(userGpioList[regCnt], &adcInputChan);
    if(ret < 0)
      return ret;    // Error

    // Each entry takes 5 bits of register value
    *regval |= (adcInputChan << (initRegShift + (regCnt * 5)));
  }
  return OK;
}

//======================================================================
// This function will place the GPIO information into the sequence registers.
// This informs the ADC which GPIOs to convert and what order to do the
// conversion.
int meadow_adc_config_sequence_regs(uint32_t userGpioXferCount, uint8_t *userGpioList)
{
  uint32_t regval;
  
  // ADC_SQR1, ADC_SQR2 and ADC_SQR3 are used to configure the sequence of the
  // conversions when ADC_CR1_SCAN is used. If there are no entries then
  // nothing will be converted. Basically, which input in which order.
  //
  // The values put in this field are found by looking at the target hardware.
  // For the FeatherV2, A00 is PA4. Next look at the data sheet
  // 'Table 11. STM32F777xx, STM32F778Ax and STM32F779xx pin and ball
  // definitions.' In the 'Pin name' column find PA4. Then look in the
  // 'Additional functions' column for the possible analog inputs for the ADC
  // being used. In this case there are 2 possible ADC1_IN4, and ADC2_IN4.
  // Since for ADC1 the value is '4' (it's also 4 for ADC2 and 3).
  int ret;
  uint32_t regCount = 0;
  uint32_t remainingCnt = userGpioXferCount;

  // Sequence Register 3 - ADC channels 1-6
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_SQR3_OFFSET);
  regval &= ADC_SQR3_RESERVED;   // Clear all SQR Bits
  if(remainingCnt > 0)
  {
    if(remainingCnt >= MEADOW_ADC_SEQ_3_REGISTER_TOTAL)
    {
      regCount = MEADOW_ADC_SEQ_3_REGISTER_TOTAL;
      remainingCnt -= MEADOW_ADC_SEQ_3_REGISTER_TOTAL;
    }
    else
    {
      regCount = remainingCnt;
      remainingCnt = 0;
    }

#if defined CONFIG_ADC_TESTS
    syslog(1, "SEQ_3-initial transfer count:%lu\n", regCount);
#endif

