WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  // Reset all the ADCs via Reset and Clock Control (RCC). For the STM32F7
  // there is a single bit for all ADCs. Other MCUs have a bit for each ADC.
  regval = getreg32(STM32_RCC_APB2RSTR);
  regval |= RCC_APB2RSTR_ADCRST;
  putreg32(regval, STM32_RCC_APB2RSTR);

  // Restore ADC from reset state
  regval = getreg32(STM32_RCC_APB2RSTR);
  regval &= ~RCC_APB2RSTR_ADCRST;
  putreg32(regval, STM32_RCC_APB2RSTR);

  // Set the ADC watchdog high and low threshold to max and min
  putreg32(0x00000fff, STM32_ADC1_BASE + STM32_ADC_HTR_OFFSET);
  putreg32(0x00000000, STM32_ADC1_BASE + STM32_ADC_LTR_OFFSET);

  //------------------------------------------------------------
  // ADC Sample Time Register - Determine how many clock cycles should each
  // conversion wait before beginning? See Ref Man sec 15.5.
  // With ADCCLK = 24MHz (see ADC_CCR_ADCPRE)
  // 000: 3 cycles Tconv = 3 + 12 = 15 cycles, 15/24,000,000 = 0.625 us
  // 001: 15 cycles
  // 010: 28 cycles
  // 011: 56 cycles
  // 100: 84 cycles
  // 101: 112 cycles Tconv = 112 + 12 = 124 cycles 124/24,000,000 = 4.667 us
  // 110: 144 cycles
  // 111: 480 cycles Tconv = 480 + 12 = 492 cycles 492/24,000,000 = 20.5 us
  // TESTING-Set all channels to the same default ADC_SMPR_DEFAULT
  // Set sample time for channels 10-18
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_SMPR1_OFFSET);
  // This #define will set all sample times to the same value. Here
  // ADC_SMPR_DEFAULTs are used to set ADC conversion the same.
  regval &= 0xf8000000;      // Clear Sample Time fields 10-18
  regval |= ADC_SMPR1_DEFAULT;

// (--) Injected ADC results with different sample times. This looks backward
// from what the Ref Man describes
//                ADC    Voltage      Temp
// ADC_SMPR_480 - 134     0.930       32.908
// ADC_SMPR_144 - 137     0.942       38.630
// ADC_SMPR_84  - 160     1.010       40.942 Changed boards-v
// ADC_SMPR_28  - 375     1.722       37.104
// ADC_SMPR_3   - 862     3.214       40.999

  // For Vbat and internal temperature overwrite with the longest sample time
  regval &= ~ADC_SMPR1_SMP17_MASK;
  regval |= (ADC_SMPR_480 << ADC_SMPR1_SMP17_SHIFT);
  regval &= ~ADC_SMPR1_SMP18_MASK;
  regval |= (ADC_SMPR_480 << ADC_SMPR1_SMP18_SHIFT);
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SMPR1_OFFSET);

  // Set sample time for channels 0-9
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_SMPR2_OFFSET);
  regval &= 0xc0000000;      // Clear sample time fields 0-9
  regval |= ADC_SMPR2_DEFAULT;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SMPR2_OFFSET);

  //---------------------------------------------------
  // ADC Control Register 1 (CR1)
  // Get the ADC Control Register 1 register. This register controls a lot of
  // options. I put the following in the same order as the Ref Man 15.13.2
  // This is mostly interrupt configuration
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR1_OFFSET);
  regval &= ~ADC_CR1_OVRIE;          // 0=Disable Overrun interrupt
  regval &= ~ADC_CR1_RES_MASK;      // Insure all resolution bit are clear
  regval |= ADC_CR1_RES_12BIT;      // Set resolution 00=12, 01=10, 10=8 or 11=6 bits
  regval &= ~ADC_CR1_AWDEN;         // 0=Disable Analog watchdog on regular channels
  regval &= ~ADC_CR1_JAWDEN;        // 0=Disable Analog watchdog on injected
  regval &= ~ADC_CR1_DISCNUM_MASK;  // Set number of discontinuous channels to 1
  regval &= ~ADC_CR1_JDISCEN;       // 0=Disable discontinuous mode on injected channels
  regval &= ~ADC_CR1_DISCEN;        // 0=Disable discontinuous mode on regular channels
  regval &= ~ADC_CR1_JAUTO;         // 0=Automatic Injected Group conversion
  regval &= ~ADC_CR1_AWDSGL;        // 0=Disable watchdog on single channel in scan mode
  // In Scan mode, the inputs selected through the ADC_SQRx
  regval |= ADC_CR1_SCAN;           // 1=Scan mode (Scans channels in ADC_SQRx registers)
  regval |= ADC_CR1_JEOCIE;         // 1=Enable interrupt for injected channels

  regval &= ~ADC_CR1_AWDIE;         // 0=Disable Analog Watchdog interrupt
  regval &= ~ADC_CR1_EOCIE;          // 0=Disable ADC interrupt for EOC
  regval &= ~ADC_CR1_AWDCH_MASK;    // Clear the watchdog channel to 00000=Chan 0
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR1_OFFSET);

  //---------------------------------------------------
  // ADC Control Register 2 (CR2)
  // Note:fields not defined in Nuttx header file have been ignored. Some
  // members of CR2 are set/cleared other places.
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval &= ~ADC_CR2_EXTEN_MASK;  // Clear bits
  regval |= ADC_CR2_EXTEN_NONE;   // No trigger from external sources
  regval &= ~ADC_CR2_ALIGN;       // 0=Right alignment (1=left alignment)
  regval &= ~ADC_CR2_EOCS;        // 1=End of each conversion, 0=End of sequence
  // Warning: the field names 'DDS' and 'DMA' exist in 2 ADC registers, CR2 and CCR.
  // DDS=0 No new DMA request is issued after the last transfer
  // DDS=1 DMA requests are issued as long as data are converted and DMA=1
  regval &= ~ADC_CR2_DDS;
  regval |= ADC_CR2_DMA;          // 1=Enable DMA
  // Disable continous conversion
  regval &= ~ADC_CR2_CONT;         // 0=Disable continuous conversion
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  //------------------------------------------------------------
  // ADC Common Control Register (CCR) [Common == for all ADCs]
  regval = getreg32(STM32_ADC_CCR);
  regval &= ~ADC_CCR_TSVREFE;       // 0=disable temperature sensor channel
  regval &= ~ADC_CCR_VBATE;         // 0=disable vbat channel

  // ADCPRE - Calculation based on PCLK2=96MHz (with 192MHz clock). Per Data
  // Sheet 5.3.24 pp 165, max ADC clock is 36MHz. Therefore, divide by 4
  // (96/4=24MHz) is the highest freq. For clock details see Meadow's board.h
  regval &= ~ADC_CCR_ADCPRE_MASK;   // Clear any bits in ADC prescaler
  regval |= ADC_CCR_ADCPRE_DIV4;    // 01=ADC prescaler PCLK2 divided by 4

  // DMA access mode for multi ADC mode
  // 00: DMA mode disabled
  // 01: DMA mode 1 enabled (2 / 3 half-words one by one - 1 then 2 then 3)
  // 10: DMA mode 2 enabled (2 / 3 half-words by pairs - 2&1 then 1&3 then 3&2)
  // 11: DMA mode 3 enabled (2 / 3 bytes by pairs - 2&1 then 1&3 then 3&2)
  regval &= ~ADC_CCR_DMA_MASK;      // Clear any bits in DMA mode (multi-ADC mode only) 
  regval |= ADC_CCR_DMA_DISABLED;   // 00 = DMA Modes (multi-ADC mode only)
  regval &= ~ADC_CCR_DDS;           // 0=No new DMA request is issued after the last transfer
  regval &= ~ADC_CCR_DELAY_MASK;    // 0000=5*Tadcclk (only used for dual/triple)
  regval &= ~ADC_CCR_MULTI_MASK;    // Clear any bits
  regval |= ADC_CCR_MULTI_NONE;     // 00000=Independent mode
  putreg32(regval, STM32_ADC_CCR);

  return OK;
}

//================================================================
// Enable ADC. This must be done before every GPIO conversion series
void meadow_adc_turn_on(void)
{
  uint32_t regval;

