WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
    // Did we go through the entire list and not find a match?
    if(mapOff == MEADOW_ADC_GPIO_CHAN_MAP_LENGTH)
    {
      syslog(LOG_ERR, "%s@%d-(P%c%d) not valid pin\n",
              __FILE__, __LINE__,
              (gpioList[gpioListOff] >> 4) + 'A',
              gpioList[gpioListOff] & 0x0f);
      return -EINVAL;   // Invalid argument
    }
  }

  //----------------------------------------------
  // Passed the tests so save needed user parameters
  _userGpioXferCount = gpioCount;
  _userVoltageResultBuf = resultBuffer;
  _meadowAdcUserInit = true;

  // There are 3 initialization steps to fully initialize the ADC for analog
  // GPIO data conversion. The first of these can be done at an earlier time
  // as it's needed for reading the internal MCU temperature and battery
  // voltage.
  if(!_hardwareConfigDone)
  {
    ret = meadow_adc_hardware_initialize();
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-Hardware initialize failed. ret:%d\n",
              __FILE__, __LINE__, ret);
      return ret;
    }
  }

  ret = meadow_adc_config_sequence_regs(gpioCount, gpioList);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Initialization failed. ret:%d\n",
              __FILE__, __LINE__, ret);
    return ret;
  }

  meadow_adc_dma_initialize(_dmaAdcBuf, _userGpioXferCount);

  return OK;
}

//=========================================================
// This public function will return the values for Vbat and Vtemp from the
// internal STM32F7 chip. The internal sersors have calibration values written
// into the chip at the time of manufacturing. This function will use these
// values to provide the most accurate possible information to the caller.
//
// Quote from Ref Man 15.10
// "The temperature sensor output voltage changes linearly with temperature.
// The offset of this linear function depends on each chip due to process
// variation (up to 45°C from one chip to another).
// The internal temperature sensor is more suited for applications that detect
// temperature variations instead of absolute temperatures. If accurate
// temperature reading is required, an external temperature sensor should be
// used"
int meadow_adc_read_temp_vbat(double *batteryVoltage, double *tempValue)
{
  int ret;
  uint16_t adcTempReading;
  uint16_t adcVrefInCal;

  ret = meadow_adc_check_first_func_call();
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Reading Temp/Vbat failed. ret:%d\n",
              __FILE__, __LINE__, ret);
    return ret;
  }

  // Has the hardware configuration been done already?
  if(!_hardwareConfigDone)
  {
    // FWIW - meadow_adc_hardware_initialize() sets up the hardware but also
    // calls meadow_adc_read_injected_temp_vref(), internally, so the
    // following call is a duplicate, but only once.
    ret = meadow_adc_hardware_initialize();
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-Reading Temp/Vbat failed. ret:%d\n",
              __FILE__, __LINE__, ret);
      return ret;
    }
  }

  // This must be before reading Vbat because it reads and sets _doubVrefInCal
  // which is used for both temperature and voltage calculations
  ret = meadow_adc_read_injected_temp_vref(&adcTempReading, &adcVrefInCal);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Temperature/Vref read error, ret:%d\n",
              __FILE__, __LINE__, ret);
    return ret;
  }

  // From Data Sheet (not Ref Man), temperatures calibration values have been
  // read at 30 and 110 degrees celsius. 
  double calAtDegC30_t1  = 30.0;     // Calibration temperature 1 in DegC
  double calAtDegC110_t2 = 110.0;    // Calibration temperature 2 in DegC
  // Get the STM factory calibration values stored in these registers.
  double calRefVal_CAL  = (double) getreg16(MEADOW_ADC_VREFINT_CAL_ADDR);
  double tempCal1_TEMP1 = (double) getreg16(MEADOW_ADC_TEMPSENSOR_CAL30_ADDR);
  double tempCal2_TEMP2 = (double) getreg16(MEADOW_ADC_TEMPSENSOR_CAL110_ADDR);

  // The adc temperature measurement value (0-4095) needs to be converted to
  // a temperature value. To do the best conversion the information in the
  // Data Sheet needs to be incorporated in the math.
  // The following equation came from http://efton.sk/STM32/STM32_VREF.pdf.
  *tempValue = calAtDegC30_t1 + (calAtDegC110_t2 - calAtDegC30_t1) * \
            ((double)adcTempReading * calRefVal_CAL - \
            tempCal1_TEMP1 * _doubVrefInCal) / \
            (_doubVrefInCal * (tempCal2_TEMP2 - tempCal1_TEMP1));
  
  // Now do the same for the battery voltage and internal CAL reference
  uint16_t adcBatteryReading;
  ret = meadow_adc_read_injected_vbat(&adcBatteryReading);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Reading Vbat Error. ret:%d\n",
              __FILE__, __LINE__, ret);
    return ret;
  }

  // Convert the Vbat reading into a voltage value
  // Note:Per Ref Man section 15.11 the Battery voltage read is VBAT/4
  // We must multiple before conversion to get the correct value.
  ret = meadow_adc_convert_adc_to_voltage(adcBatteryReading * 4, batteryVoltage);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-VBat Conversion Error. ret:%d\n",
              __FILE__, __LINE__, ret);
    return ret;
  }

  return OK;
}

//================================================================
// Calling this function will free all the allocations and configurations
// that the current active configuration has changed.
int meadow_adc_unconfigure_active_config()
{
  uint32_t regval;
  
  // Turn off ADC
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval &= ~ADC_CR2_ADON;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  // Stop DMA
  regval  = getreg32(STM32_DMA2_S0CR);
  regval &= ~DMA_SCR_EN;
  putreg32(regval, STM32_DMA2_S0CR);

  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR1_OFFSET);
  regval &= ~ADC_CR1_SCAN;           // 1=Scan mode (Scans channels in ADC_SQRx registers)
  regval &= ~ADC_CR1_EOCIE;          // 1=Enable ADC interrupt for EOC (not with DMA)
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR1_OFFSET);

  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval &= ~ADC_CR2_DMA;          // 0=Disable DMA
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

