WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  regval = getreg32(STM32_ADC1_SQR1);
  regval &= ADC_SQR1_RESERVED;   // Clear all SQR Bits
  putreg32(regval, STM32_ADC1_SQR1);

  regval = getreg32(STM32_ADC1_SQR2);
  regval &= ADC_SQR2_RESERVED;   // Clear all SQR Bits
  putreg32(regval, STM32_ADC1_SQR2);

  regval = getreg32(STM32_ADC1_SQR3);
  regval &= ADC_SQR3_RESERVED;   // Clear all SQR Bits
  putreg32(regval, STM32_ADC1_SQR3);

  regval = getreg32(STM32_ADC_CCR);
  regval &= ~ADC_CCR_TSVREFE;       // 0=disable temperature sensor channel
  regval &= ~ADC_CCR_VBATE;         // 0=disable vbat channel
  regval &= ~ADC_CCR_ADCPRE_MASK;   // Clear any bits in ADC prescaler
  regval &= ~ADC_CCR_DMA_MASK;      // Clear any bits in DMA mode (multi-ADC mode only) 
  regval &= ~ADC_CCR_DELAY_MASK;    // 0000=5*Tadcclk (only used for dual/triple)
  regval &= ~ADC_CCR_MULTI_MASK;    // Clear any bits
  regval |= ADC_CCR_MULTI_NONE;     // 00000=Independent mode
  putreg32(regval, STM32_ADC_CCR);

  // The active configuration must have an active DMA handle from the Nuttx
  // DMA configuration call.
  if(_dmaHandle != NULL)
  {
    stm32_dmastop(_dmaHandle);
    stm32_dmafree(_dmaHandle); 
  }
  _dmaHandle = NULL;

  if(_dmaAdcBuf != NULL)
  {
    free(_dmaAdcBuf);
  }

  _meadowAdcRegInit = false;
  return OK;
}

//=========================================================
// Calling this function will initiate the ADC converstion process. It will
// run until the configured buffer is full. When the buffer is full (or error)
// the calling thread will return to the caller, signifing that the buffer
// is ready for inspection.
int meadow_adc_read_conversions(void)
{
  if(! _meadowAdcUserInit)
  {
    syslog(LOG_ERR, "%s@%d-Error:Meadow ADC not configured\n",
              __FILE__, __LINE__);
    return -EPERM;    // Operation not permitted
  }

  // Since not doing continous conversion we need to start ADC each time
  meadow_adc_restart();

  // Wait for conversion to finish for valid data
  meadow_adc_buffer_takesem(&_gpioDoneSem);

  // The following is used to determine if the output truely follows the analog
  // input as it switches above and below mid-point of Vdd.
#if MEADOW_ADC_TEST_TOGGLE_ADC_INPUT > 0
  // Note to execute the following display adds about 26 ms
  // Show data before copy
  static int callCount = 0;
  static int previousNoChg = 0;
  callCount++;
  if(previousNoChg != _noChangeCnt)
  {
    syslog(LOG_ERR, "%s@%d-%04d-Error Count:%05d\n",
                  __FILE__, __LINE__, callCount, _noChangeCnt - 1);
  }
  previousNoChg = _noChangeCnt;
#endif

  // ADC conversion must have completed. Now convert the collected data
  // to voltage and copy to the user's buffer.
  for(int valOff = 0; valOff < _userGpioXferCount; valOff++)
  {
    int ret;
    double convVoltage;

    // _dmaAdcBuf contain the adc output values (0-4095) placed there by DMA.
    //  Convert these values to a voltage and for the user.
    ret = meadow_adc_convert_adc_to_voltage(_dmaAdcBuf[valOff], &convVoltage);
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-Error:ADC to Voltage, ret:%d\n",
              __FILE__, __LINE__, ret);
      return ret;
    }

    _userVoltageResultBuf[valOff] = convVoltage;
  }

  return OK;
}
